Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: That told the bot (who is logged into the channel as ayita) to remember a certain URL as the answer to the query "diff-cmd". Now we can address ayita, asking the bot to tell another user about diff-cmd:
gl: Así lle dixo ao bot (que está rexistrado no canal como ayita) que lembre unha certa URL como resposta á consulta "diff.cmd". Agora poderemos dirixirnos a ayita para que informe outro usuario acerca de diff-cmd:

source: The same thing can be accomplished via a convenient shorthand:
gl: O mesmo pode facerse mediante un atallo axeitado:

source: The exact command set and behaviors differ from bot to bot. The above example is with <literal>ayita</literal> (<ulink url="http://hix.nu/svn-public/alexis/trunk/"></ulink>), of which there is usually an instance running in <literal>#svn</literal> at freenode. Other bots include Dancer (<ulink url="http://dancer.sourceforge.net/"></ulink>) and Supybot (<ulink url="http://supybot.com/"></ulink>). Note that no special server privileges are required to run a bot. A bot is a client program; anyone can set one up and direct it to listen to a particular server/channel.
gl: A configuración exacta do comando e os comportamentos varían dun bot a outro. O exemplo anterior é para <literal>ayita</literal> (<ulink url="http://hix.nu/svn-public/alexis/trunk/"></ulink>do que normalmente hai unha instancia funcionando no canal <literal>#svn</literal> en freenode. Outros bots son Dancer (<ulink url="http://dancer.sourceforge.net/"></ulink>) e Supybot (<ulink url="http://supybot.com/"></ulink>). Non son precisos privilexios especiais para executar un bot. Un bot é un programa cliente; calquera pode pór un en marcha e dirixilo para que escoite un determinado servidor/canal.

source: If your channel tends to get the same questions over and over, I highly recommend setting up a bot. Only a small percentage of channel users will acquire the expertise needed to manipulate the bot, but those users will answer a disproportionately high percentage of questions, because the bot enables them to respond so much more efficiently.
gl: Se no teu canal se tende a repetir as mesmas preguntas unha e outra vez, eu recoméndoche implementar un bot. Tan só un número pequeno de usuarios do canal vai adquirir a experiencia necesaria para manipular o bot, mais son os mesmos usuarios que van responder a un número desproporcionadamente grande de cuestións, xa que o bot vailles permitir facelo de xeito moito máis eficiente.

source: Archiving IRC
gl: Arquivando o IRC

source: Although it is possible to archive everything that happens in an IRC channel, it's not necessarily expected. IRC conversations may be nominally public, but many people think of them as informal, semi-private conversations. Users may be careless with grammar, and often express opinions (for example, about other software or other programmers) that they wouldn't want preserved forever in an online archive.
gl: Aínda que é posible arquivar todo o que ocorre nun canal IRC, non necesariamente se espera que o fagas. As conversacións IRC poden ser nominalmente públicas, mais moita xente pensa que son semiprivadas e informais. Talvez os usuarios non teñan coidado coa gramática, e a miúdo expresen opinións (por exemplo, acerca de outro software ou outros programadores) que non queren que sexan gardadas para sempre nun arquivo en liña.

source: Of course, there will sometimes be <emphasis>excerpts</emphasis> that should be preserved, and that's fine. Most IRC clients can log a conversation to a file at the user's request, or failing that, one can always just cut and paste the conversation from IRC into a more permanent forum (most often the bug tracker). But indiscriminate logging may make some users uneasy. If you do archive everything, make sure you state so clearly in the channel topic, and give a URL to the archive.
gl: Por suposto, sempre haberá <emphasis>citas</emphasis> que deberían ser conservadas, e iso está ben. Os máis dos clientes IRC poden rexistrar unha conversación nun ficheiro, ou se iso non é posible, un sempre pode "copiar e pegar" a conversación do IRC a un foro máis permanente (frecuentemente o sistema de xestión de incidencias). Mais tamén o rexistro indiscriminado pode facer que algúns usuarios se sintan incómodos. Se arquivares absolutamente todo, deberías ter a seguridade de que iso está claramente establecido no tema do canal, e que hai unha URL coñecida do arquivo.

source: <firstterm>RSS</firstterm> (Really Simple Syndication) is a mechanism for distributing meta-data-rich news summaries to "subscribers", that is, people who have indicated an interest in receiving those summaries. A given RSS source is usually called a <firstterm>feed</firstterm>, and the user's subscription interface is called a <firstterm>feed reader</firstterm> or <firstterm>feed aggregator</firstterm>. <ulink url="http://www.rssbandit.org/">RSS Bandit</ulink> and the eponymous <ulink url="http://www.feedreader.com/">Feedreader</ulink> are two open source RSS readers, for example.
gl: <firstterm>RSS</firstterm> (Really Simple Syndication) é un mecanismo para distribuír resumos de noticias, moi ricos en metadatos, aos usuarios subscritos, é dicir: á xente que manifestou o seu interese en recibiren eses resumos. Unha fonte RSS determinada é normalmente denominada un <firstterm>feed</firstterm>, e a interface de subscrición é chamada <firstterm>lector de feed</firstterm> ou <firstterm>agregador de feed </firstterm>. <ulink url="http://www.rssbandit.org/">RSS Bandit</ulink> e o epónimo <ulink url="http://www.feedreader.com/">Feedreader</ulink> son dous lectores de RSS de código aberto, por exemplo.

source: There is not space here for a detailed technical explanation of RSS<footnote><para>See <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html"></ulink> for that.</para></footnote>, but you should be aware of two main things. First, the feed reading software is chosen by the subscriber and is <emphasis>the same</emphasis> for all the feeds that subscriber monitors&nbsp;&mdash;&nbsp;in fact, this is the major selling point of RSS: that the subscriber chooses one interface to use for all their feeds, so each feed can concentrate just on delivering content. Second, RSS is now ubiquitous, so much so that most people who use it don't even know they're using it. To the world at large, RSS looks like a little button on a web page, with a label saying "Subscribe to this site" or "News feed". You click on the button, and from then on, your feed reader (which may well be an applet embedded in your home page) automatically updates whenever there's news from the site.
gl: Non hai espazo aquí para facer unha explicación técnica detallada de RSS<footnote><para>podes ver <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html"></ulink> para maior información.</para></footnote>, mais deberías ter en conta dúas cousas. A primeira é que o software de lectura de feeds é seleccionado polo usuario e vai ser <emphasis>o mesmo</emphasis> para todos os feeds que o subscritor estea a monitorizar&nbsp;&mdash;&nbsp;de feito, este é o maior atractivo de RSS: que o subscritor escolle usar unha interface para todos os feeds, así que cada feed ten que concentrarse exclusivamente en servir os contidos. A segunda é que o RSS é xa ubicuo, tanto que as máis das persoas que están a empregalo nin saben que o usan. Cara á xente en xeral, RSS ten o aspecto dun pequeno botón nunha páxina web, cunha etiqueta que di "Subscríbete a este sitio" ou "Feed de noticias". Ti premes o botón, e de aí en adiante o teu lector de feed (que pode perfectamente ser unha applet embebida na túa páxina web) actualízase automaticamente cada vez que se introduce unha novidade na web de orixe.

source: This means that your open source project should probably offer an RSS feed (note that many of the canned hosting sites&nbsp;&mdash;&nbsp;see <xref linkend="canned-hosting"/>&nbsp;&mdash;&nbsp;offer it right out of the box). Be careful not to post so many news items each day that subscribers can't separate the wheat from the chaff. If there are too many news events, people will just ignore the feed, or even unsubscribe in exasperation. Ideally, a project would offer separate feeds, one for big announcements, another following (say) events in the issue tracker, another for each mailing list, etc. In practice, this is hard to do well: it can result in interface confusion both for visitors to the project's web site and for the administrators. But at a minimum, the project should offer one RSS feed on the front page, for sending out major announcements such as releases and security alerts.
gl: Isto quere dicir que o teu proxecto de software de fontes abertas debería probablemente ofrecer un feed RSS (os máis dos sitios de aloxamento preconfigurado xa o ofrecen como opción por defecto&nbsp;&mdash;&nbsp;véxase <xref linkend="aloxamento-preconfigurado"/>&nbsp;&mdash;&nbsp;). Mais ten coidado de non publicares tantas novas ao día que os subscritores non sexan quen de separar o gran da palla. Se hai demasiados eventos de novas, a xente simplemente vai ignorar o feed ou, aínda peor, vaise dar de baixa por desesperación. Idealmente, un proxecto debería ofertar feeds separados: un para os grandes anuncios, outro seguindo (digamos) os eventos do xestor de incidencias, outro para cada lista de correo, etc. Na práctica, isto é difícil de facer en condicións: pode producir confusión de interfaces tanto para os visitantes da web do proxecto como para os administradores. Mais como mínimo, o proxecto debería ofrecer un feed RSS na portada da web para enviar novas sobre os eventos máis relevantes, tales como novas versións ou avisos de seguridade.

source: Credit where credit is due: this section wasn't in the first published edition of the book, but Brian Aker's blog entry <ulink url="http://krow.livejournal.com/564980.html">"Release Criteria, Open Source, Thoughts On..."</ulink> reminded me of the usefulness of RSS feeds for open source projects.
gl: Ao César o que é do César <footnote><para>Nota do tradutor: tradución libre do orixinal inglés: "Credit where credit is due"</para></footnote>: esta sección non estaba na primeira edición do libro, mais a entrada <ulink url="http://krow.livejournal.com/564980.html">"Release Criteria, Open Source, Thoughts On..."</ulink> no blog de Brian Aker fíxome decatarme da utilidade dos feed RSS para os proxectos de software de fontes abertas.

source: A <firstterm>wiki</firstterm> is a web site that allows any visitor to edit or extend its content; the term "wiki" (from a Hawaiian word meaning "quick" or "super-fast") is also used to refer to the software that enables such editing. Wikis were invented in 1995, but their popularity has really started to take off since 2000 or 2001, boosted partly by the success of Wikipedia (<ulink url="http://www.wikipedia.org/"></ulink>), a wiki-based free-content encyclopedia. Think of a wiki as falling somewhere between IRC and web pages: wikis don't happen in realtime, so people get a chance to ponder and polish their contributions, but they are also very easy to add to, involving less interface overhead than editing a regular web page.
gl: Unha <firstterm>wiki</firstterm> é un sitio web que permite que cada visitante poida editar e estender os seus contidos; o termo "wiki" (que significa "áxil" ou "super-rápido" en hawaiano) úsase tamén para denominar o software que permite facer esa edición. As wikis foron inventadas en 1995, mais a súa popularidade comezou a aumentar a partir de 2000 ou 2001, acelerada en parte polo éxito da Wikipedia (<ulink url="http://www.wikipedia.org/"></ulink> ou a súa versión en galego: <ulink url="http://gl.wikipedia.org/"></ulink>), unha enciclopedia con contidos libres baseada en wiki. Podes pensar nunha wiki como algo intermedio entre o IRC e as páxinas web: as wikis non se editan en tempo real, de feito que a xente ten tempo de pulir e ponderar as súas contribucións, mais engadirlle contidos é tamén moi doado, implicando menor complexidade que a edición dunha páxina web.

source: Wikis are not yet standard equipment for open source projects, but they probably will be soon. As they are relatively new technology, and people are still experimenting with different ways of using them, I will just offer a few words of caution here&mdash;at this stage, it's easier to analyze misuses of wikis than to analyze their successes.
gl: As wikis non son aínda equipamentos estándar para os proxectos de software de fontes abertas, mais probablemente o sexan logo. <footnote><para>Nota do tradutor: de feito, xa no momento de facerse esta tradución (decembro de 2009), practicamente todos os proxectos que se desenvolven de xeito colaborativo contan con cadansúa wiki. Sexa para publicar a documentación e a información de soporte ao usuario, ou como "centro de mando" da totalidade do proxecto</para></footnote>. Como son unha tecnoloxía relativamente nova, e a xente está a experimentar con formas diversas de usalas, vou simplemente aconsellarvos unhas poucas precaucións&mdash;neste punto, é máis doado analizar os usos incorrectos das wikis que os seus éxitos.

source: If you decide to run a wiki, put a lot of effort into having a clear page organization and pleasing visual layout, so that visitors (i.e., potential editors) will instinctively know how to fit in their contributions. Equally important, post those standards on the wiki itself, so people have somewhere to go for guidance. Too often, wiki administrators fall victim to the fantasy that because hordes of visitors are individually adding high quality content to the site, the sum of all these contributions must therefore also be of high quality. That's not how web sites work. Each individual page or paragraph may be good when considered by itself, but it will not be good if embedded in a disorganized or confusing whole. Too often, wikis suffer from:
gl: Se decidires montar unha wiki, dedica bastante esforzo a conseguir unha organización clara da páxina e unha distribución visual agradable, para que os visitantes (p.e.: editores potenciais) saiban de xeito instintivo como encaixar as súas contribucións. Igualmente importante, publica as instrucións na propia wiki, así a xente terá un sitio ao que acudiren en busca de axuda. Con demasiada frecuencia, os administradores de wikis caen vítimas da fantasía de que, xa que hordas de visitantes van engadir á wiki contidos de alta calidade, a suma de todas as contribucións individuais vai ser en consecuencia de alta calidade. Non é así como traballan os sitios web. Cada páxina individual ou parágrafo pode ser bo se se considera isoladamente, mais pode non selo se está integrado nun conxunto confuso ou desorganizado. Moi frecuentemente, as wikis sofren de:

source: <emphasis role="bold">Lack of navigational principles.</emphasis> A well-organized web site makes visitors feel like they know where they are at any time. For example, if the pages are well-designed, people can intuitively tell the difference between a "table of contents" region and a "content" region. Contributors to a wiki will respect such differences too, but only if the differences are present to begin with.
gl: <emphasis role="bold">Ausencia de principios de navegación.</emphasis> Un sitio web ben organizado fai que os visitantes sintan que saben onde están en cada momento. Por exemplo, se as páxinas están ben deseñadas, a xente vai saber intuitivamente a diferenza entre unha rexión de "táboa de contidos" e unha rexión de "contidos". Os contribuidores a unha wiki van respectar esa diferenza, mais só se a diferenza está claramente establecida desde o principio.

source: <emphasis role="bold">Duplication of information.</emphasis> Wikis frequently end up with different pages saying similar things, because the individual contributors did not notice the duplications. This can be partly a consequence of the lack of navigational principles noted above, in that people may not find the duplicate content if it is not where they expect it to be.
gl: <emphasis role="bold">Duplicación da información.</emphasis> As wikis acaban frecuentemente con varias páxinas dicindo cousas similares, dado que os contribuidores individuais non van ser conscientes da duplicación. Isto pode ser consecuencia en parte da ausencia de principios de navegación comentados antes, debido a que a xente pode non atopar os contidos duplicados se non están onde esperan que estean.

source: <emphasis role="bold">Inconsistent target audience.</emphasis> To some degree this problem is inevitable when there are so many authors, but it can be lessened if there are written guidelines about how to create new content. It also helps to aggressively edit new contributions at the beginning, as an example, so that the standards start to sink in.
gl: <emphasis role="bold">Audiencia obxectivo mal definida.</emphasis> Ata un certo punto, este problema é inevitable cando hai tantos autores diferentes, mais pode ser minimizado se previamente se escriben unha serie de consellos e guías acerca de como crear novos contidos. Editar unha chea de novos contidos a modo de exemplo ao principio tamén axuda, de xeito que os estándares fiquen xa afirmados.

source: The common solution to all these problems is the same: have editorial standards, and demonstrate them not only by posting them, but by editing pages to adhere to them. In general, wikis will amplify any failings in their original material, since contributors imitate whatever patterns they see in front of them. Don't just set up the wiki and hope everything falls into place. You must also prime it with well-written content, so people have a template to follow.
gl: A solución máis común a todos estes problemas é a mesma: fixar estándares editoriais, e demostralos non só publicándoos, se non publicando páxinas que os poñan en práctica. En xeral, as wikis van amplificar calquera erro nos seus materiais orixinais, xa que os colaboradores tenden a imitar os padróns que teñen á vista. Non poñas en marcha a wiki e fiques esperando a que todo axuste axeitadamente. Deberás tamén alimentala con materiais escritos, para que a xente teña un modelo que seguir.

source: The shining example of a well-run wiki is Wikipedia, though this may be partly because the content (encyclopedia entries) is naturally well-suited to the wiki format. But if you examine Wikipedia closely, you'll see that its administrators laid a <emphasis>very</emphasis> thorough foundation for cooperation. There is extensive documentation on how to write new entries, how to maintain an appropriate point of view, what sorts of edits to make, what edits to avoid, a dispute resolution process for contested edits (involving several stages, including eventual arbitration), and so forth. They also have authorization controls, so that if a page is the target of repeated inappropriate edits, they can lock it down until the problem is resolved. In other words, they didn't just throw some templates onto a web site and hope for the best. Wikipedia works because its founders thought carefully about how to get thousands of strangers to tailor their writing to a common vision. While you may not need the same level of preparedness to run a wiki for a free software project, the spirit is worth emulating.
gl: O exemplo máis brillante dunha wiki ben administrada é a Wikipedia, aínda que isto pode ser así en parte porque os seus contidos (entradas dunha enciclopedia) encaixan de forma natural co formato wiki. Mais se examinares atentamente a Wikipedia, verás que os seus administradores deseñaron unha <emphasis>moi</emphasis> ben pensada infraestrutura para a cooperación. Hai unha boa cantidade de documentación sobre como escribir novas entradas, como manter un axeitado punto de vista, que clase de edicións facer, que edicións evitar, un procedemento para a resolución de disputas a respecto de edicións controvertidas (a base de varios pasos, incluíndo eventualmente a arbitraxe), etc. Tamén teñen controis de autoría, de xeito que se unha páxina é obxecto de repetidas edicións inapropiadas, poden bloqueala ata que o problema se resolve. En outras verbas, os seus autores non se limitaron a pór unha serie de moldes nunha web e esperar o mellor. Wikipedia funciona porque os seus fundadores pensaron coidadosamente acerca de como conseguir que milleiros de estranos axustasen os seus escritos a unha visión común. Aínda que ti seguramente non vas precisar un nivel preciso de preparación para montar a wiki dun proxecto de software de fontes abertas, paga a pena emular o seu espírito.

source: For more information about wikis, see <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>. Also, the first wiki remains alive and well, and contains a lot of discussion about running wikis: see <ulink url="http://www.c2.com/cgi/wiki?WelcomeVisitors"></ulink>, <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorks"></ulink>, and <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorksNot"></ulink> for various points of view.
gl: Para máis información acerca das wikis, podes consultar <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>. Tamén a primeira wiki está viva e goza de boa saúde, e contén unha chea de discusións acerca de como administrar wikis: podes ver <ulink url="http://www.c2.com/cgi/wiki?WelcomeVisitors"></ulink>, <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorks"></ulink>, e <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorksNot"></ulink> para analizares varios puntos de vista sobre o tema.

source: Web Site
gl: Páxina web

source: There is not much to say about setting up the project web site from a technical point of view: setting up a web server and writing web pages are fairly simple tasks, and most of the important things to say about layout and arrangement were covered in the previous chapter. The web site's main function is to present a clear and welcoming overview of the project, and to bind together the other tools (the version control system, bug tracker, etc.). If you don't have the expertise to set up a web server yourself, it's usually not hard to find someone who does and is willing to help out. Nonetheless, to save time and effort, people often prefer to use one of the canned hosting sites.
gl: Non hai moito que dicir acerca da posta en marcha da web dun proxecto desde un punto de vista técnico: montar un sitio web e escribir páxinas son tarefas realmente simples, e as máis das cousas importantes que se poden dicir acerca do seu deseño e distribución de contidos foron xa comentadas no capítulo anterior. A principal función do sitio web é a de presentar unha clara e amena visión xeral do proxecto, e enmarcar as restantes ferramentas (o sistema de control de versións, o xestor de incidencias, etc.) Se non es experto na construción de webs, xeralmente non che vai ser difícil atopares alguén que si o é e que estea desexando axudar na materia. Porén, para aforrar tempo e esforzos, a xente xeralmente prefire facer uso de webs pre-enlatadas.

source: Canned Hosting
gl: Aloxamento preenlatado
